Repository: AdrianoDiDio/FlutterBiometricAuthFrontend
Catalog: lib/l10n/intl_*.arb
Languages: it_it

# loginButton
source: Login
it_it: Accedi

# registerButton
source: Register
it_it: Registrati

# loginFailed
source: Wrong Username or Password
it_it: Username o Password errati

# emailAlreadyInUse
source: Email is already registered
it_it: La mail è gia stata registrata

# passwordTooCommon
source: Password is too common...please choose another one
it_it: La password è troppo comune...perfavore scegli una nuova password

# usernameNotUnique
source: Username is already taken...please choose another one
it_it: L'username è gia registrato...scegli un nuovo username

# registrationDialogTitle
source: Registration
it_it: Registrazione

# registrationDialogContent
source: Registration was successfull...Username: {username} Id: {id} Email:{email}
it_it: La registrazione è avvenuta correttamente...Username: {username} Id: {id} Email:{email}

# usernameEmpty
source: Username is empty
it_it: Il campo Nome Utente è vuoto

# emailEmpty
source: Email is empty
it_it: Il campo Email è vuoto

# invalidEmail
source: Email is not valid
it_it: L'email non è valida

# passwordEmpty
source: Password is empty
it_it: Il campo password è vuoto

# passwordTooShort
source: Password must have at least 8 characters
it_it: La password deve contenere almeno 8 caratteri

# passwordDoesNotMatch
source: The two password doesn't match
it_it: Le due password non coincidono

# confirmPasswordHint
source: Confirm Password
it_it: Conferma Password

# unauthorizedError
source: User is not authorized
it_it: L'utente non è autorizzato

# refreshAccessTokenFailure
source: Couldn't refresh access token...try to log-in again
it_it: Non è stato possibile aggiornare l'access token...prova ad effettuare il login di nuovo

# homeScreenTitle
source: User Info
it_it: Utente

# settingsScreenTitle
source: Settings
it_it: Impostazioni

# settingsScreenCommonEntry
source: General
it_it: Generale

# settingsScreenLanguageEntry
source: Language
it_it: Lingua

# settingsScreenThemeEntry
source: Theme
it_it: Tema

# settingsScreenThemeSystemEntry
source: Use system theme
it_it: Usa il tema di sistema

# settingsScreenThemeLightEntry
source: Use light theme
it_it: Usa il tema chiaro

# settingsScreenThemeDarkEntry
source: Use dark theme
it_it: Usa il tema scuro

# homeScreenUserInfoEntry
source: User
it_it: Utente

# homeScreenSettingsEntry
source: Settings
it_it: Impostazioni

# homeScreenUserInfoTitle
source: User Info
it_it: Informazioni Utente

# logoutFailure
source: Failed to perform logout...token may have been revoked
it_it: Impossibile effettuare il logout...il token potrebbe essere stato inserito in blacklist

# logoutButtonTextEntry
source: Logout
it_it: Esci

# loginScreenTitle
source: Login
it_it: Accedi

# registerScreenTitle
source: Register
it_it: Registrati

# settingsScreenBiometricEntry
source: Use Fingerprint to login
it_it: Usa l'impronta digitale per effettuare il login

# biometricsScreenTitle
source: Biometric Authentication
it_it: Autenticazione Biometrica

# serverFailure
source: Server isn't reachable at the moment...check your connection or try later
it_it: Il server non è raggiungibile al momento...controlla la tua connessione o riprova più tardi

# unknownError
source: An unknown error has occurred...try later or contact support
it_it: Errore sconosciuto...riprova più tardi o contatta il supporto

# getBiometricTokenFailure
source: Couldn't generate a biometric token...try later...
it_it: Non è stato possibile generare il token biometrico...riprova più tardi

# decryptRSAFailure
source: Failed to decrypt biometric token...please log-in using username/password and try to enroll again
it_it: Non è stato possibile decifrare il token biometrico...perfavore effettua il log-in usando username/password ed effettua nuovamente il processo di attivazione biometrico

# dialogErrorTitle
source: Error
it_it: Errore

# invalidBiometricToken
source: Biometric token is not valid...please log-in using username/password and try to enroll again
it_it: Il token biometrico non è valido...perfavore effettua il log-in usando username/password ed effettua nuovamente il processo di attivazione biometrico

# enableBiometricAuthenticationEntry
source: Enable biometric authentication
it_it: Abilita autenticazione biometrica

# biometricLoginText
source: Login using biometrics
it_it: Accedi utilizzando i dati biometrici

# biometricSignReason
source: Touch sensor to sign the payload
it_it: Tocca il sensore per effettuare la firma del payload

# biometricHint
source: Touch sensor to login
it_it: Tocca il sensore per effettuare il login

# biometricNotRecognized
source: Fingerprint not recognized...try again
it_it: Impronta non riconosciuta...prova di nuovo

# biometricSuccess
source: Authentication successful
it_it: Autenticazione avvenuta con successo

# biometricTitle
source: Biometric Authentication
it_it: Autenticazione Biometrica

# biometricSettingsRedirect
source: Go to settings
it_it: Vai alle impostazioni

# biometricSettingsRedirectReason
source: Biometric authentication is not set up on your device
it_it: L'autenticazione biometrica non è configurata per questo dispositivo

# biometricLockOut
source: Biometric authentication is disabled...try locking and unlocking the screen to enable it
it_it: L'autenticazione biometrica è disabilitata...prova a bloccare e sbloccare lo schermo per abilitarla

# biometricLoginCancel
source: Login using username and password
it_it: Accedi utilizzando username e password

# biometricSignCancel
source: Cancel biometric authentication
it_it: Annulla il processo di autenticazione biometrica

# biometricGenerateKeysFailure
source: Error generating keypair
it_it: Errore durante la creazione del KeyPair

# biometricSignPayloadFailure
source: Error signing payload
it_it: Errore durante la firma del payload

# biometricDecryptCiphertextFailure
source: Error decrypting ciphertext
it_it: Errore durante la decrittazione del ciphertext

# biometricDecryptCiphertextCancelled
source: Error decrypting ciphertext...user cancelled it
it_it: Errore durante la decrittazione del ciphertext...l'utente ha chiuso il dialogo
